name: Sysmon Password Policy Discovery
id: 76e5a2d8-e844-11ea-984c-784f43710739
version: 1
date: '2020-08-27'
description: Adversaries may attempt to access detailed information about the password policy used within an enterprise network.
  Password policies can be set and discovered on Windows, Linux, and macOS systems via various command shell utilities
   such as net accounts (/domain), chage -l , cat /etc/pam.d/common-password, and pwpolicy getaccountpolicies.
how_to_implement: In order to properly run this search, Splunk needs to ingest data from sysmon and feed the datamodel Endpoint.Processes.
type: ESCU
references: []
author: Guillaume Malbrand, Splunk
search: '| tstats count max(_time) as _time from datamodel="Endpoint.Processes" where Processes.process_exec="net.exe" Processes.process=*accounts*
by Processes.dest Processes.process Processes.user
| eval mitre_technique="T1201"'
known_false_positives: None at this time.
tags:
  analytics_story:
    - Sysmon Hunting
  mitre_attack_id:
    - T1201
  security_domain:
    - Endpoint
