name: Sysmon Hunting Password Policy Discovery
id: 4d581ede-e851-11ea-b0c8-784f43710739
version: 1
date: '2020-08-27'
description: This search provides detection information on unauthenticated requests
  against Kubernetes' Pods API
type: ESCU
author: Guillaume Malbrand, Splunk
search: '| tstats count max(_time) as _time from datamodel="Endpoint.Processes" where Processes.process_exec="net.exe" Processes.process=*accounts*
by Processes.dest Processes.process Processes.user | `sysmon_hunting_password_policy_discovery_filter`'
known_false_positives: Not all unauthenticated requests are malicious, but frequency,
  UA and source IPs and direct request to API provide context.
tags:
  analytics_story:
  - Sysmon Hunting
  kill_chain_phases:
  - Reconnaissance
  mitre_attack_id:
  - T1078.004
  security_domain: Endpoint
  asset_type: Endpoint
